app/controllers/articles_controller.rb

	def create
		#render plain: params[:article].inspect
		@article = Article.new(article_params)

		if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My Article"], ["text", "This is a new article!"], ["created_at", "2015-05-12 16:13:39.249788"], ["updated_at", "2015-05-12 16:13:39.249788"]]