app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 6]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
---
  	def edit
  		@comment = Comment.find(params[:id])
  		@article = Article.find(params[:article_id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "Ana"], ["body", "Awesome!!!"], ["article_id", 1], ["created_at", "2015-05-12 17:47:42.655303"], ["updated_at", "2015-05-12 17:47:42.655303"]]
---
	def create
		@article = Article.find(params[:article_id])
		# create automatically link comment to belong to article
		@comment = @article.comments.create(comment_params) #@article.comments hierarchy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 2], ["id", 6]]
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "yes it's me again yeyy"], ["updated_at", "2015-05-13 18:06:31.040404"], ["id", 6]]
---
	def update
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])

		@comment.update_attributes(comment_params)